Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2580.PIC
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF6SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF6SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xD61">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF6EID16" edc:desc="" edc:mask="0x1" edc:name="RXF6EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID17" edc:desc="" edc:mask="0x1" edc:name="RXF6EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF6EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF6EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF6SID0" edc:desc="" edc:mask="0x1" edc:name="RXF6SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6SID1" edc:desc="" edc:mask="0x1" edc:name="RXF6SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6SID2" edc:desc="" edc:mask="0x1" edc:name="RXF6SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF6EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF6EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD62">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF6EID8" edc:desc="" edc:mask="0x1" edc:name="RXF6EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID9" edc:desc="" edc:mask="0x1" edc:name="RXF6EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID10" edc:desc="" edc:mask="0x1" edc:name="RXF6EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID11" edc:desc="" edc:mask="0x1" edc:name="RXF6EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID12" edc:desc="" edc:mask="0x1" edc:name="RXF6EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID13" edc:desc="" edc:mask="0x1" edc:name="RXF6EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID14" edc:desc="" edc:mask="0x1" edc:name="RXF6EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID15" edc:desc="" edc:mask="0x1" edc:name="RXF6EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF6EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF6EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF6EID0" edc:desc="" edc:mask="0x1" edc:name="RXF6EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID1" edc:desc="" edc:mask="0x1" edc:name="RXF6EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID2" edc:desc="" edc:mask="0x1" edc:name="RXF6EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID3" edc:desc="" edc:mask="0x1" edc:name="RXF6EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID4" edc:desc="" edc:mask="0x1" edc:name="RXF6EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID5" edc:desc="" edc:mask="0x1" edc:name="RXF6EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID6" edc:desc="" edc:mask="0x1" edc:name="RXF6EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF6EID7" edc:desc="" edc:mask="0x1" edc:name="RXF6EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF7SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF7SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD64">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF7SID3" edc:desc="" edc:mask="0x1" edc:name="RXF7SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID4" edc:desc="" edc:mask="0x1" edc:name="RXF7SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID5" edc:desc="" edc:mask="0x1" edc:name="RXF7SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID6" edc:desc="" edc:mask="0x1" edc:name="RXF7SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID7" edc:desc="" edc:mask="0x1" edc:name="RXF7SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID8" edc:desc="" edc:mask="0x1" edc:name="RXF7SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID9" edc:desc="" edc:mask="0x1" edc:name="RXF7SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID10" edc:desc="" edc:mask="0x1" edc:name="RXF7SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF7SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF7SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xD65">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF7EID16" edc:desc="" edc:mask="0x1" edc:name="RXF7EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID17" edc:desc="" edc:mask="0x1" edc:name="RXF7EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF7EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF7EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID0" edc:desc="" edc:mask="0x1" edc:name="RXF7SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID1" edc:desc="" edc:mask="0x1" edc:name="RXF7SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID2" edc:desc="" edc:mask="0x1" edc:name="RXF7SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
