Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2580.PIC
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF11SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF11SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xD79">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF11EID16" edc:desc="" edc:mask="0x1" edc:name="RXF11EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID17" edc:desc="" edc:mask="0x1" edc:name="RXF11EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF11EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF11EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID0" edc:desc="" edc:mask="0x1" edc:name="RXF11SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID1" edc:desc="" edc:mask="0x1" edc:name="RXF11SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID2" edc:desc="" edc:mask="0x1" edc:name="RXF11SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF11EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF11EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD7A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF11EID8" edc:desc="" edc:mask="0x1" edc:name="RXF11EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID9" edc:desc="" edc:mask="0x1" edc:name="RXF11EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID10" edc:desc="" edc:mask="0x1" edc:name="RXF11EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID11" edc:desc="" edc:mask="0x1" edc:name="RXF11EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID12" edc:desc="" edc:mask="0x1" edc:name="RXF11EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID13" edc:desc="" edc:mask="0x1" edc:name="RXF11EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID14" edc:desc="" edc:mask="0x1" edc:name="RXF11EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID15" edc:desc="" edc:mask="0x1" edc:name="RXF11EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF11EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF11EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD7B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF11EID0" edc:desc="" edc:mask="0x1" edc:name="RXF11EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID1" edc:desc="" edc:mask="0x1" edc:name="RXF11EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID2" edc:desc="" edc:mask="0x1" edc:name="RXF11EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID3" edc:desc="" edc:mask="0x1" edc:name="RXF11EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID4" edc:desc="" edc:mask="0x1" edc:name="RXF11EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID5" edc:desc="" edc:mask="0x1" edc:name="RXF11EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID6" edc:desc="" edc:mask="0x1" edc:name="RXF11EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11EID7" edc:desc="" edc:mask="0x1" edc:name="RXF11EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xD7C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF12SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF12SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD80">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF12SID3" edc:desc="" edc:mask="0x1" edc:name="RXF12SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID4" edc:desc="" edc:mask="0x1" edc:name="RXF12SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID5" edc:desc="" edc:mask="0x1" edc:name="RXF12SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID6" edc:desc="" edc:mask="0x1" edc:name="RXF12SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID7" edc:desc="" edc:mask="0x1" edc:name="RXF12SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID8" edc:desc="" edc:mask="0x1" edc:name="RXF12SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID9" edc:desc="" edc:mask="0x1" edc:name="RXF12SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID10" edc:desc="" edc:mask="0x1" edc:name="RXF12SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
