Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2580.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF49">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D30" edc:desc="" edc:mask="0x1" edc:name="TXB0D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D31" edc:desc="" edc:mask="0x1" edc:name="TXB0D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D32" edc:desc="" edc:mask="0x1" edc:name="TXB0D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D33" edc:desc="" edc:mask="0x1" edc:name="TXB0D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D34" edc:desc="" edc:mask="0x1" edc:name="TXB0D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D35" edc:desc="" edc:mask="0x1" edc:name="TXB0D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D36" edc:desc="" edc:mask="0x1" edc:name="TXB0D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D37" edc:desc="" edc:mask="0x1" edc:name="TXB0D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF4A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D40" edc:desc="" edc:mask="0x1" edc:name="TXB0D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D41" edc:desc="" edc:mask="0x1" edc:name="TXB0D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D42" edc:desc="" edc:mask="0x1" edc:name="TXB0D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D43" edc:desc="" edc:mask="0x1" edc:name="TXB0D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D44" edc:desc="" edc:mask="0x1" edc:name="TXB0D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D45" edc:desc="" edc:mask="0x1" edc:name="TXB0D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D46" edc:desc="" edc:mask="0x1" edc:name="TXB0D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D47" edc:desc="" edc:mask="0x1" edc:name="TXB0D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF4B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D50" edc:desc="" edc:mask="0x1" edc:name="TXB0D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D51" edc:desc="" edc:mask="0x1" edc:name="TXB0D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D52" edc:desc="" edc:mask="0x1" edc:name="TXB0D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D53" edc:desc="" edc:mask="0x1" edc:name="TXB0D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D54" edc:desc="" edc:mask="0x1" edc:name="TXB0D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D55" edc:desc="" edc:mask="0x1" edc:name="TXB0D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D56" edc:desc="" edc:mask="0x1" edc:name="TXB0D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D57" edc:desc="" edc:mask="0x1" edc:name="TXB0D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF4C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D60" edc:desc="" edc:mask="0x1" edc:name="TXB0D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D61" edc:desc="" edc:mask="0x1" edc:name="TXB0D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D62" edc:desc="" edc:mask="0x1" edc:name="TXB0D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D63" edc:desc="" edc:mask="0x1" edc:name="TXB0D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D64" edc:desc="" edc:mask="0x1" edc:name="TXB0D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D65" edc:desc="" edc:mask="0x1" edc:name="TXB0D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D66" edc:desc="" edc:mask="0x1" edc:name="TXB0D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D67" edc:desc="" edc:mask="0x1" edc:name="TXB0D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF4D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D70" edc:desc="" edc:mask="0x1" edc:name="TXB0D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D71" edc:desc="" edc:mask="0x1" edc:name="TXB0D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D72" edc:desc="" edc:mask="0x1" edc:name="TXB0D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D73" edc:desc="" edc:mask="0x1" edc:name="TXB0D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D74" edc:desc="" edc:mask="0x1" edc:name="TXB0D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D75" edc:desc="" edc:mask="0x1" edc:name="TXB0D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D76" edc:desc="" edc:mask="0x1" edc:name="TXB0D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D77" edc:desc="" edc:mask="0x1" edc:name="TXB0D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO1" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF4E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE4" edc:desc="" edc:mask="0x1" edc:name="ICODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO1" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xF4F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="cnnrrnrr" edc:cname="RXB1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXB1CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF50">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_FILHIT3" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO_FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM0_RTRRO" edc:desc="" edc:mask="0x1" edc:name="RXM0/RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXM0" edc:desc="" edc:mask="0x1" edc:name="RXM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1FILHIT0" edc:desc="" edc:mask="0x1" edc:name="RXB1FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1FILHIT1" edc:desc="" edc:mask="0x1" edc:name="RXB1FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1FILHIT2" edc:desc="" edc:mask="0x1" edc:name="RXB1FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1FILHIT3" edc:desc="" edc:mask="0x1" edc:name="RXB1FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1FILHIT4" edc:desc="" edc:mask="0x1" edc:name="RXB1FILHIT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1M0" edc:desc="" edc:mask="0x1" edc:name="RXB1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1M1" edc:desc="" edc:mask="0x1" edc:name="RXB1M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1FUL" edc:desc="" edc:mask="0x1" edc:name="RXB1FUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RXB1RTRR0" edc:desc="" edc:mask="0x1" edc:name="RXB1RTRR0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1RTRRO" edc:desc="" edc:mask="0x1" edc:name="RXB1RTRRO" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
